# Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

# Формат ввода
# Одно натуральное число NN

# Формат вывода
# NN строк с фразой: "Купи слона!"

string = "Купи слона!\n"
print(string * int(input()))
